examples/DRLinFluids_DFDRL_cylinder/env02/0/ddt0(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.750";
    object      ddt0(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   nonuniform List<vector> 
16200
(
(-7.7141 -2.20189 1.3259e-19)
(-5.0886 -9.54581 3.76665e-18)
(-6.17793 -8.26622 0)
(-1.88542 -17.0036 -4.34294e-18)
(-7.88059 1.1879 -1.4462e-18)
(-7.04029 -5.35741 0)
(-2.11948 -10.1671 -4.55217e-18)
(0.643097 -18.8967 0)
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<vector> 
21
(
(-2.62091 0.88966 0)
(-8.50096 5.0501 6.36934e-19)
(0.333385 0.150653 1.48299e-19)
(8.09983 0.731823 1.0664e-19)
(6.91761 0.468479 0)
(-5.84174 3.17344 2.49013e-20)
(-1.50993 0.0498773 -1.86901e-25)
(2.66699 0.322359 1.55027e-20)
(-5.08654 2.15495 0)
(-7.02496 3.48982 -4.18352e-19)
(8.61314 -0.986625 0)
(2.90822 -0.778036 2.40718e-19)
(5.14633 -1.88818 1.81797e-19)
(5.67799 1.09587 -1.54879e-20)
(7.11225 -1.89131 0)
(-8.09008 5.66329 -4.22656e-21)
(9.46171 0.61938 0)
(-7.21966 4.77635 8.99852e-20)
(-2.77761 1.79722 -2.49456e-20)
(-8.33558 5.71742 0)
(0.867528 0.207199 0)
)
;
    }
    TOP
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    BOTTOM
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    CYLINDER
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    JET1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    JET2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
