examples/DRLinFluids_DFDRL_cylinder/env02/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.750";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform 0;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 0;
    }
    TOP
    {
        type            calculated;
        value           nonuniform List<scalar> 
110
(
5.99687
1.87064
2.08929
2.36972
3.81208
3.95009
4.01683
4.00422
...
)
;
    }
    BOTTOM
    {
        type            calculated;
        value           nonuniform List<scalar> 
110
(
2.07402
3.71888
4.03228
4.29999
4.51709
4.65116
4.67466
4.72601
...
)
;
    }
    CYLINDER
    {
        type            calculated;
        value           nonuniform List<scalar> 
594
(
0.442212
0.601549
0.502042
0.4308
0.429917
0.440523
0.412793
0.518934
...
)
;
    }
    JET1
    {
        type            calculated;
        value           nonuniform List<scalar> 
17
(
0.323896
0.416822
0.292455
0.368088
0.23928
0.418779
0.445689
0.438789
0.395459
0.487317
0.301678
0.341672
0.371758
0.314916
0.423747
0.431564
0.322303
)
;
    }
    JET2
    {
        type            calculated;
        value           nonuniform List<scalar> 
17
(
0.0984946
0.0544522
0.117301
0.124807
0.0794903
0.0884919
0.103203
0.0624616
0.0952798
0.0421285
0.0683891
0.0846511
0.0987441
0.121647
0.0313614
0.125208
0.119362
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
